def list_words(number: int):
    try:
        words = {
            0: 'Собака',
            1: 'Кошка',
            2: 'Питон',
            3: 'Птица',
            4: 'Машина',
            5: 'Корабль',
            6: 'Самолет',
            7: 'Пиво',
            8: 'Чипсы',
            9: 'Отчисление',
            10: 'Стипендия',
            11: 'МИРЭА',
            12: 'Преподаватель',
            13: 'Студент',
            14: 'Пропуск',
            15: 'Прогул',
            16: 'Отдых',
            17: 'Сессия',
            18: 'Муки'
        }
        return words[number]
    except KeyError:
        return 'Ошибка!'